results/multiphase/multiphaseFOM/highDrop/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       104500;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       104650;
    }
    top
    {
        type            patch;
        nFaces          350;
        startFace       104800;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          350;
        startFace       105150;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          105000;
        startFace       105500;
    }
)

// ************************************************************************* //
