results/multiphase/multiphaseFOM/highDrop/system/setExprFieldsDict
/*--------------------------------*- C++-*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

expressions
(

	alpha.water
	{
		field 			alpha.water;
		dimensions		[0 0 0 0 0 0 0];

		constants
		{
			radius 	0.5;
		}
		condition
		#{
			(pos().y()-2)*(pos().y()-2) + (pos().x()-2.5)*(pos().x()-2.5) < 0.5 || pos().y() < 0
		#};
		expression
		#{
			1
		#};
	}

);

// * * * * * * * * * * * * * * * * * * * * * * * * * * //